<!--Задано прямокутну матрицю E(5,4). Отримати нову матрицю,-->
<!--поділивши всі невід’ємні елементи на 5, а всі від’ємні елементи — на 10.-->

<?php
$E = [
    [5, -10, 5, -7],
    [10, 4, -6, 8],
    [9, -5, -10, 11],
    [6, -4, 10, -4],
    [7, -25, -1, 2]
];
// Проходження по кожному елементу матриці
for ($i = 0; $i < count($E); $i++) {
    for ($j = 0; $j < count($E[$i]); $j++) {
        // Перевірка на додатність або від'ємність
        if ($E[$i][$j] >= 0) {
            // Ділення на 5 для невід'ємних елементів
            $E[$i][$j] /= 5;
        } else {
            // Ділення на 10 для від'ємних елементів
            $E[$i][$j] /= 10;
        }
    }
}
echo "Нова матриця:<br>";
foreach ($E as $row) {
    foreach ($row as $element) {
        echo $element . " ";
    }
    echo "<br>";
}
?>